docs/emacs/modes/helm-dash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>helm-dash</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">helm-dash</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd924a87">1. 概述</a></li>
<li><a href="#orge0431be">2. 安装</a>
<ul>
<li><a href="#org00e31ea">2.1. 安装 docsets</a></li>
</ul>
</li>
<li><a href="#org29c28a5">3. 配置</a></li>
<li><a href="#org3be5441">4. 使用</a></li>
<li><a href="#org1806da9">5. Docsets 集合</a>
<ul>
<li><a href="#org12ed97d">5.1. common docsets</a></li>
<li><a href="#orgb56687b">5.2. Buffer local docsets</a></li>
<li><a href="#org02bffd4">5.3. only one docset</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd924a87" class="outline-2">
<h2 id="orgd924a87"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
此程序在 Emacs 中使用 <a href="http://www.kapeli.com/dash">Dash</a> docsets 浏览文档。它不需要 Dash 应用程序。这是一篇解释它的基本用法的文章。
</p>
</div>
</div>

<div id="outline-container-orge0431be" class="outline-2">
<h2 id="orge0431be"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org00e31ea" class="outline-3">
<h3 id="org00e31ea"><span class="section-number-3">2.1</span> 安装 docsets</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Helm-dash 使用与 Dash 相同的 docset。可以使用 <code>m-x helm-dash-install-docset</code> 安装官方 docsets，也可以使用 <code>m-x helm-dash-install-user-docset</code> 安装用户提供的 docsets（实验性）。
</p>

<p>
注意：安装过程中可能会失败，多试几次。
</p>
</div>
</div>
</div>

<div id="outline-container-org29c28a5" class="outline-2">
<h2 id="org29c28a5"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<p>
helm-dash-docsets-path 是 docsets 的前缀。 默认为 <code>~/.docsets</code>
</p>

<p>
helm-dash-min-length 设置 helm-dash 开始搜索的长度。默认为 3。
</p>

<p>
helm-dash-browser-func 是一个封装浏览 Dash docsets 的方法的函数。默认为 browse-url。例如，如果您想使用 eww 浏览您的 docsets，执行： <code>(setq helm-dash-browser-func'eww)</code> 。
</p>

<p>
当 helm-dash-enable-debugging 不是 nil，会捕获来自 sqlite 的标准错误并显示在缓冲区中。 默认值为 t。 将此设置为 nil 可能会加快某些计算机上的查询速度（捕获 stderr 需要为每个查询创建和删除临时文件）。
</p>
</div>
</div>


<div id="outline-container-org3be5441" class="outline-2">
<h2 id="org3be5441"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>m-x helm-dash RET</code> 将在加载了生效的 docset 的情况下运行 helm。键入待搜索的字符串。
</p>
<ul class="org-ul">
<li>搜索从 3 个字符开始。</li>

<li>使用 <code>m-x helm-dash-install-docset</code> 安装新的 docsets</li>

<li>安装新的 docset 之后，将 docset 的名称添加到 <code>helm-dash-common-docsets</code> 或 <code>helm-dash-docsets</code> 。</li>
</ul>

<p>
<code>m-x helm-dash-at-point RET</code>  就像 helm-dash，但它会使用 point 处的符号作为搜索。
</p>

<p>
命令 <code>helm-dash-reset-connections</code> 将清除与所有 sqlite db 的连接。添加新文档集出现错误时使用它。下一次调用 helm-dash 将重新创建它们。
</p>
</div>
</div>

<div id="outline-container-org1806da9" class="outline-2">
<h2 id="org1806da9"><span class="section-number-2">5</span> Docsets 集合</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org12ed97d" class="outline-3">
<h3 id="org12ed97d"><span class="section-number-3">5.1</span> common docsets</h3>
<div class="outline-text-3" id="text-5-1">
<p>
helm-dash-common-docsets 是一个列表，应该包含在所有缓冲区中始终处于活动状态的 docsets。
</p>
</div>
</div>

<div id="outline-container-orgb56687b" class="outline-3">
<h3 id="orgb56687b"><span class="section-number-3">5.2</span> Buffer local docsets</h3>
<div class="outline-text-3" id="text-5-2">
<p>
可以根据缓冲区激活不同的 docset 子集。目前（它可能在将来发生变化）我们认为它是一个普通的局部变量，应该为每种不同的文件类型设置。 通过这种方式，还可以设置类似项目的 docsets 集：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">go-doc</span> ()
  (<span style="color: #a1db00;">interactive</span>)
  (<span style="color: #a1db00;">setq-local</span> helm-dash-docsets '(<span style="color: #ff4ea3;">"Go"</span>)))
(add-hook 'go-mode-hook 'go-doc)
</pre>
</div>
</div>
</div>

<div id="outline-container-org02bffd4" class="outline-3">
<h3 id="org02bffd4"><span class="section-number-3">5.3</span> only one docset</h3>
<div class="outline-text-3" id="text-5-3">
<p>
要将搜索范围缩小到一个 docset，请在搜索开头键入其名称，后跟空格。docset 可以包含空格。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:54</p>
<p class="validation"></p>
</div>
</body>
</html>
